app/controllers/auth_controller.rb

  def login
    @user = User.find_by(email: user_params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'santiago.gutierrez@zappistore.com' LIMIT 1

  def register
    @user = User.create!(user_params)
---
INSERT INTO "users" ("email", "password_digest", "name", "created_at", "updated_at") VALUES ('test@example.com', '$2a$12$lhgWNLUJ5c3AqnZyty2dCehNDh28l4HS/Ajgjt36qLktkOJ5ROiFO', 'Test User', '2025-06-19 09:25:50.028701', '2025-06-19 09:25:50.028701') RETURNING "id"