app/controllers/files_controller.rb

SELECT SUM("user_files"."file_size") FROM "user_files" LEFT OUTER JOIN "active_storage_attachments" ON "active_storage_attachments"."record_type" = 'UserFile' AND "active_storage_attachments"."name" = 'file' AND "active_storage_attachments"."record_id" = "user_files"."id" LEFT OUTER JOIN "active_storage_blobs" ON "active_storage_blobs"."id" = "active_storage_attachments"."blob_id" WHERE "user_files"."user_id" = 1
---
  def index
    @user_files = current_user.user_files.recent.includes(file_attachment: :blob)

    files_data = @user_files.map do |user_file|
      {
        id: user_file.id,
        filename: user_file.filename,
        content_type: user_file.content_type,
        file_size: user_file.file_size,
        human_readable_size: user_file.human_readable_size,
        uploaded_at: user_file.uploaded_at,
        is_image: user_file.image?,
        is_text: user_file.text?,
        file_extension: user_file.file_extension,
        download_url: user_file.file.attached? ? rails_blob_path(user_file.file, disposition: "attachment") : nil
      }
    end

    render json: {
      files: files_data,
      total_count: @user_files.count,
      total_size: @user_files.sum(:file_size),
      human_readable_total_size: human_readable_size(@user_files.sum(:file_size))

DELETE FROM "user_files" WHERE "user_files"."id" = 7
---
  def destroy
    authorize_file_access!(@user_file)

    if @user_file.destroy

SELECT "user_files".* FROM "user_files" WHERE "user_files"."id" = 4 LIMIT 1
---
  def set_user_file
    @user_file = UserFile.find(params[:id])