app/controllers/uploads_controller.rb

INSERT INTO "user_files" ("user_id", "filename", "content_type", "file_size", "uploaded_at", "created_at", "updated_at") VALUES (1, 'test_file.txt', 'text/plain', 26, '2025-06-19 10:23:01.318243', '2025-06-19 10:23:01.318438', '2025-06-19 10:23:01.318438') RETURNING "id"
UPDATE "user_files" SET "updated_at" = '2025-06-19 10:23:01.354692' WHERE "user_files"."id" = 3
---
      uploaded_at: Time.current
    )

    if @user_file.save