app/controllers/uploads_controller.rb

      uploaded_at: Time.current
    )

    if @user_file.save
---
UPDATE "user_files" SET "updated_at" = '2025-06-19 09:29:45.753037' WHERE "user_files"."id" = 1
INSERT INTO "user_files" ("user_id", "filename", "content_type", "file_size", "uploaded_at", "created_at", "updated_at") VALUES (2, 'Screenshot 2025-06-19 at 10.29.34.png', 'image/png', 11875, '2025-06-19 09:29:45.733622', '2025-06-19 09:29:45.733853', '2025-06-19 09:29:45.733853') RETURNING "id"